; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	GroundStation4 - direction
	GroundStation3 - direction
	Star2 - direction
	Star0 - direction
	Star1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 spectrograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 spectrograph1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 Star2)
	(supports instrument5 spectrograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument7 spectrograph0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star0)
	(supports instrument8 spectrograph0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite1 GroundStation3)
	(pointing satellite3 Planet11)
	(have_image Phenomenon5 spectrograph0)
	(have_image Star6 spectrograph1)
	(have_image Star7 spectrograph0)
	(have_image Planet8 spectrograph0)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph1)
))

)

; plan
1. (turn_to satellite3 planet11 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet11)
   goals met: 1 of 10
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 10
3. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 1 of 10
4. (turn_to satellite2 planet11 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet11)
   goals met: 1 of 10
5. (take_image satellite2 planet11 instrument6 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 2 of 10
6. (turn_to satellite2 phenomenon5 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon5)
   goals met: 2 of 10
7. (take_image satellite2 phenomenon5 instrument6 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 3 of 10
8. (turn_to satellite2 phenomenon10 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 10
9. (turn_to satellite1 groundstation3 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation3)
   goals met: 4 of 10
10. (turn_to satellite0 star2 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star2)
   goals met: 5 of 10
11. (take_image satellite2 phenomenon10 instrument6 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 6 of 10
12. (turn_to satellite2 planet8 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet8)
   goals met: 6 of 10
13. (take_image satellite2 planet8 instrument6 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 7 of 10
14. (turn_to satellite2 star6 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 star6)
   goals met: 7 of 10
15. (take_image satellite2 star6 instrument6 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 8 of 10
16. (turn_to satellite2 star7 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star7)
   goals met: 8 of 10
17. (take_image satellite2 star7 instrument6 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 9 of 10
18. (turn_to satellite2 star9 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star9)
   goals met: 9 of 10
19. (take_image satellite2 star9 instrument6 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 10 of 10
